{
  "add_prefix_space": false,
  "backend": "tokenizers",
  "bos_token": "[CLS]",
  "cls_token": "[CLS]",
  "do_lower_case": false,
  "eos_token": "[SEP]",
  "errors": "replace",
  "is_local": false,
  "mask_token": "[MASK]",
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "[PAD]",
  "sep_token": "[SEP]",
  "tokenizer_class": "DebertaTokenizer",
  "unk_token": "[UNK]",
  "vocab_type": "gpt2"
}
